<template v-slot:page2>
  <article class="article-inner">
    <div class="article-container">
      <h3 class="headline">Creator Profile</h3>
      <p><img src="./my_icon.png" alt="leveldrain" width="170em"></p>
      <p>元フロントエンドエンジニア上島の弟子。<br>
        活動名 Level Drain、本名「佐村木 友紀（さむらき ゆき）」。<br>
        フロントエンドを中心に、サーバサイドもそこそこ触ることができる。
      </p>
      <p>佐村木は全国70人程度のレア苗字。
        <ruby>職人
          <rt>アルティザン</rt>
        </ruby>
        の家系。<br>
        脳科学者に憧れバイオ研究者になるが、実験が下手すぎてデータ分析に回る。<br>
        元より攻殻機動隊やゼルダの伝説に憧れていたため、大学院修了後はIT業界に転生。
      </p>

      <h3 class="headline">Philosophy</h3>
      <p>制作ポリシーとしては「ちょっとした思いやり」を意識。<br>
        技術面のスキルより、結局のところ社会スキルの比重が大きいと様々な挫折から学んだため。
      </p>

      <h3 class="headline">ささやかな気配り</h3>
      <p>当たり前だが、「ありがとう」「ごめんなさい」は自然に言うよう心がける。<br>
        実装項目について「褒めてくれ」「認めてくれ」とは大抵の人が堂々と言えないので、<br>
        細やかなフィードバックが次の指標になればいいという考えから。</p>
      <p>また、困ったことはお互い様だということに気を付けている。<br>
        悩んでパフォーマンスが落ちたメンバーに対して「ネガティブはブロック」という態度を取らないようにしている。</p>

      <h3 class="headline">作業依頼者への気配り</h3>
      <p>スキルの限りではあるが、指定された仕様の +α をなるべく心がける。<br>
        納品するコードはメンテしやすいようコメントを記載したりクラス名を工夫したり。<br>
        拘りをできるだけ作らず、その状況に応じたコーディングレギュレーションや開発環境に従う。</p>

      <h3 class="headline">楽しいは正義</h3>
      <p>何よりも仕事が楽しいと感じるかどうか。<br>
        無理にいやいや仕事しても、メンタル病みながら仕事をしても、<br>
        結局出来上がるアプリケーションはあまり褒められたものに仕上がらない。<br>
        楽しいの目安は「8時間を8時間以内と思えるかどうか」であり、フロー理論というやつに基づく。
      </p>

      <h3 class="headline">Career</h3>
      <p>2009年 脳科学者になりたいと思い、長浜バイオ大学に入学。<br>
        在学中に統計学や生命情報科学、3DCGに興味を持つ。実験に挫折。<br>
        2013年 奈良先端科学技術大学院大学で生命情報科学の研究室に入る。<br>
        実験データのビックデータ解析を行う。<br>
        2015年 アミューズメント系企業に入社。データ分析の経験から、ソーシャルゲームのパラメータ調整を行う。<br>
        2015 - 2017年 GUIの設計やWebページ分析業務、ディレクション等を行っていた。<br>
        2017年 制作の方に進むべく全財産を投資して京都コンピュータ学院に入学。<br>
        2020年 SIer のWeb開発者としてアシスタントからスタート</p>
    </div>
  </article>
</template>

<script>
import './styles_article.css'

export default {
  name: "Article2",
}
</script>