<template v-slot:page2>
  <article class="article-inner">
    <div class="article-container">
      <h3 class="headline">Creator Profile</h3>
      <p><img src="./my_icon.png" alt="leveldrain" width="170em"></p>
      <p>元フロントエンドエンジニア上島の弟子。<br>
        活動名 Level Drain、本名「佐村木 友紀（さむらき ゆき）」。<br>
        アダルト系ゲームのレベルデザイナーからフロントエンドエンジニアへ転生。
      </p>
      <p>佐村木は全国70人程度のレア苗字。
        <ruby>職人
          <rt>アルティザン</rt>
        </ruby>
        の家系。<br>
        脳科学者に憧れバイオ研究者になるが、実験が下手すぎてデータ分析に回る。<br>
        元より攻殻機動隊やゼルダの伝説に憧れていたため、大学院修了後はIT業界に転生。<br>
        性格は、ゲームのキャラで言えば「熱血な騎士」か「正直で素直な村人」ポジション。猫派。
      </p>

      <h4 class="headline">Philosophy</h4>
      <p>制作ポリシーとしては信頼関係をまず重視します。<br>
        技術面のスキルより、結局のところ社会スキルの比重が大きいと様々な挫折から学んだためです。<br>
        信頼関係に基づく依頼であれば、技術面は可能な限り対応します。</p>

      <h4 class="headline-lv2">ささやかな気配り</h4>
      <p>「ありがとう」「ごめんなさい」は自然に言うよう心がける。<br>
        当たり前ですが、昨今はできていない人をよく見ます。</p>

      <h4 class="headline-lv2">作業依頼者への気配り</h4>
      <p>スキルの限りではありますが、指定された仕様の +α を目標にして開発します。<br>
        納品するコードはメンテしやすいようコメントを記載したりクラス名を工夫したりします。<br>
        拘りをできるだけ作らず、その状況に応じたコーディングレギュレーションや開発環境に従います。</p>

      <h4 class="headline-lv2">楽しもうという姿勢</h4>
      <p>何よりも仕事が「辛くない」と感じるかどうか。楽しければ更にヨシ。<br>
        無理にいやいや仕事しても、メンタル病みながら仕事をしても、<br>
        結局出来上がる成果物はあまり褒められたものではないことを現場で見てきたため。<br>
        あまり得意ではないものの、楽しみを見つけるよう心がけています。
      </p>

      <h3 class="headline">Career</h3>
      <p>2009年 脳科学者になりたいと思い、長浜バイオ大学に入学。<br>
        在学中に統計学や生命情報科学、3DCGに興味を持つ。実験に挫折。<br>
        2013年 奈良先端科学技術大学院大学で生命情報科学の研究室に入る。<br>
        実験データのビックデータ解析を行う。<br>
        2015年 アミューズメント系企業に入社。データ分析の経験から、ソーシャルゲームのパラメータ調整を行う。<br>
        2015 - 2017年 GUIの設計やWebページ分析業務、ディレクション等を行っていた。<br>
        2017年 制作の方に進むべく全財産を投資して京都コンピュータ学院に入学。<br>
        2020年 SIer のWeb開発者としてアシスタントからスタート</p>
    </div>
  </article>
</template>

<script>
import './styles_article.css'

export default {
  name: "Article2",
}
</script>